package com.example.zin.tafeelat;

public class Faelon {


    /*
     اصطلاحات عروضية:
    الصحة: خلو التفعيلة من الزحافات والعلل --> فعولن: 11010
    الخبن: حذف الثاني الساكن من السبب الخفيف --> فعِلن: 1110
    القطع: حذف ساكن الوتد المجموع (علن) وتسكين ما قبله --> فعْلن (فاعل): 1010
     */

    /*
    // الأبحر المحتوية على (فاعلن)

//    المتدارك، وفيه الاحتمالات (فاعلن، فعٍلن، فعْلن)

    للتفعيلات كافة في أي من الشطرين، الاحتمالات الثلاثة كلها:
    صحيحة: 10110
    مخبونة: 1110
    مقطوعة: 1010
    ***********

    // البسيط، وفيه الاحتمالات (فاعلن، فعٍلن، فعْلن)

    ترد التفعيلة مرتين في كل شطر

    التفعيلة الأولى في أي شطر لها احتمالان:
     صحيحة: 10110
    مخبونة: 1110
    *******************


    للتفعيلة الثانية في الشطر الأول (العروض)، الاحتمالان:
     مخبونة: 1110
     (خاصة بالتصريع)   مقطوعة: 1010
     ********************

    للتفعيلة الثانية في الشطر الثاني (الضرب)، الاحتمالان:
    مخبونة: 1110
   مقطوعة: 1010
     */

    String first_saheeh = "10110";
    String second_makhboon = "1110";
    String third_magtooh = "1010";

}
