package com.example.zin.tafeelat;

public class Faoolon {

    /*
     اصطلاحات عروضية:
    الصحة: خلو التفعيلة من الزحافات والعلل --> فعولن: 11010
    الحذف: حذف السبب الخفيف (لن) من آخر التفعيلة --> فعو: 110
    القصر: حذف ساكن السبب الأخير (لن) وتسكين ما قبله --> فعول: 1100
    البتر: الحذف(فعولن->فعو) + القطع(فعو-> فعْ) --> فعْ: 10
    القبض: حذف الخامس الساكن --> فعولن: 1101
     */

    /*
     //الأبحر المحتوية على (فعولن)

     المتقارب، وفيه الاحتمالات (فعولن، فعولُ، فعولْ، فعو، فعْ)

     للتفعيلات الثلاثة الأولى في أي من الشطرين، احتمالان:
     صحيحة: 11010
     مقبوضة: 1101
     *****************

 للتفعيلة الرابعة في الشطر الأول (العروضِ)، أربعة احتمالات:
    صحيحة: 11010
    مقبوضة: 1101
    محذوفة: 110
    مقصورة: 1100
    بتراء: 10
    *****************

    للتفعيلة الرابعة في الشطر الثاني (الضرب)، أربعة احتمالات:
    صحيحة: 11010
    محذوفة: 110
    مقصورة: 1100
    بتراء: 10


    // الطويل: وفيه الاحتمالان (فعولن، فعولُ)

    ترد التفعيلة مرتين في الشطر الواحد

    التفعيلة في أي شطر لها احتمالان:
    صحيحة: 11010
    مقبوضة: 1101

     */
    String first_saheeh =  "11010";   // المتقارب & الطويل
    String second_magbood = "1101";   // المتقارب & الطويل
    String third_mahthoof =  "110";   // المتقارب
    String forth_abtar =      "10";   //المتقارب
    String fifth_magsoor =  "1100";   // المتقارب


}
